/**
  ******************************************************************************
  * @file    AHRS.cpp
  * @version 2.0
  * @author  DUT-Lingbug Embedded Group
  * @brief   姿态解算AHRS基类
  *
  ******************************************************************************
  * @attention
  *
  * Copyright 2023 DUT-Lingbug.
  * All rights reserved.
  *
  ******************************************************************************
  */

#include "Modules/CanTask/CANSendTask.h"

/***********************************************************************
** 函 数 名： CANSendTask构造函数
** 函数说明： 指定CAN设备、CAN发送链接（CAN_Rx_Data_Pack_t）、
              发送时间间隔
**---------------------------------------------------------------------
** 输入参数： CAN设备、CAN发送链接（CAN_Rx_Data_Pack_t）、
              发送时间间隔
** 返回参数： 无
***********************************************************************/
CANSendTask::CANSendTask(Robot &robot0, robo_lib::CanDevice* device0, timeus_t interval_tick_us0) : Task_Base()
{
  this->device = device0;
  this->interval_tick_us = interval_tick_us0;
}

/***********************************************************************
** 函 数 名： CANSendTask::init()
** 函数说明： 初始化CAN发送任务
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void CANSendTask::init(void)
{

}

/***********************************************************************
** 函 数 名： CANSendTask::update(timeus_t dT_us)
** 函数说明： 更新CAN发送任务
**---------------------------------------------------------------------
** 输入参数： 更新时间间隔（us）
** 返回参数： 无
***********************************************************************/
void CANSendTask::update(timeus_t dT_us)
{
  this->device->update(dT_us);
}

/***********************************************************************
** 函 数 名： CANSendTask::uninit()
** 函数说明： 任务反初始化
**---------------------------------------------------------------------
** 输入参数： 无
** 返回参数： 无
***********************************************************************/
void CANSendTask::uninit(void)
{

}
