/**
  ******************************************************************************
  * @file    AHRS.cpp
  * @version 2.0
  * @author  DUT-Lingbug Embedded Group
  * @brief   姿态解算AHRS基类
  *
  ******************************************************************************
  * @attention
  *
  * Copyright 2023 DUT-Lingbug.
  * All rights reserved.
  *
  ******************************************************************************
  */

#include "Libraries/Motor/Motor_Backend.h"

namespace robo_lib
{
/***********************************************************************
** 函 数 名： Motor_Backend::Motor_Backend()
** 函数说明： 构造函数，初始化引用变量motor=motor0
**---------------------------------------------------------------------
** 输入参数： 引用成员变量 &motor0
** 返回参数： 无
***********************************************************************/
Motor_Backend::Motor_Backend(Motor &motor0) : motor(motor0)
{
}

/***********************************************************************
** 函 数 名： Motor_Backend::publishMeasurement()
** 函数说明： 将测量结果com_msr publish到motor结构体的数组中
**---------------------------------------------------------------------
** 输入参数： Motor &motor0
** 返回参数： 无
***********************************************************************/
void Motor_Backend::publishMeasurement(void)
{
  motor.measurement[id] = com_msr;
}

}